{"buildingblocks":[{"id":"257","name":"Account Settings","summary":"Along with password reset, access to their basic account detail and settings is standard operating procedure for any platform.  Don&rsquo;t make developers look for their settings, give quick access to settings and allow for easy updates. If developers do not have access to change their settings themselves, they will be asking you for assistance requiring additional resources.","details":"Along with password reset, access to their basic account detail and settings is standard operating procedure for any platform.  Don&rsquo;t make developers look for their settings, give quick access to settings and allow for easy updates. If developers do not have access to change their settings themselves, they will be asking you for assistance requiring additional resources.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-account-settings.png","width":"150","tags":"","category":"Account Settings","categoryslug":"developer-account"},{"id":"251","name":"Advertising","summary":"Advertising is a proven monetization tool when building web or mobile advertising.  Many popular APIs are deploying their own advertising platforms or integrating with existing advertising platforms for web or mobile devices.  Advertising is not relevant for all APIs, but API owners should consider the opportunities advertising could offer for their API developers. There are many other monetizatio","details":"Advertising is a proven monetization tool when building web or mobile advertising.  Many popular APIs are deploying their own advertising platforms or integrating with existing advertising platforms for web or mobile devices.  Advertising is not relevant for all APIs, but API owners should consider the opportunities advertising could offer for their API developers. There are many other monetization models being developed by API owners, and goes beyond the scope of this paper.  Don&rsquo;t stop with just affiliate programs and advertising, make sure and look a little deeper.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-bullhorn-advertising.png","width":"150","tags":"","category":"Advertising","categoryslug":"monetization"},{"id":"207","name":"Affiliate Program","summary":"Affiliate programs offer business rewards to affiliates for each visitor or customer brought about by the affiliate's own marketing efforts. Affiliate programs are increasingly being integrated with API developer ecosystems, sharing API revenue with the developers that build applications around the API. Revenue sharing opportunities for developers are a great incentive for them to learn about an A","details":"Affiliate programs offer business rewards to affiliates for each visitor or customer brought about by the affiliate's own marketing efforts. Affiliate programs are increasingly being integrated with API developer ecosystems, sharing API revenue with the developers that build applications around the API. Revenue sharing opportunities for developers are a great incentive for them to learn about an API, and build solid applications that consume API services.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-handshake.jpg","width":"0","tags":"Marketing,Monetization","category":"Affiliate Program","categoryslug":"monetization"},{"id":"240","name":"Android","summary":"When it comes to mobile development, Google&rsquo;s Android platform is definitely the number two player in the space, and warrants similar attention as the iOS building block.  Consider providing Java code samples and SDKs specifically for the Android mobile platform.  Android is picking up momentum in the space and with new devices being released all the time, API owners can&rsquo;t ignore the p","details":"When it comes to mobile development, Google&rsquo;s Android platform is definitely the number two player in the space, and warrants similar attention as the iOS building block.  Consider providing Java code samples and SDKs specifically for the Android mobile platform.  Android is picking up momentum in the space and with new devices being released all the time, API owners can&rsquo;t ignore the platform as a serious contender.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-android.jpg","width":"150","tags":"","category":"Android","categoryslug":"mobile"},{"id":"209","name":"API Explorer","summary":"API explorers allow users to make calls and explore REST APIs using a web interface. The simplicity of REST has contributed to the extreme growth in the number of Web APIs in the last year, and API explorers are going to fuel this growth. API explorers put the power of Web APIs in the hands of non-developers, allowing journalists, students, politicians, and any tech savvy Internet user to access t","details":"API explorers allow users to make calls and explore REST APIs using a web interface. The simplicity of REST has contributed to the extreme growth in the number of Web APIs in the last year, and API explorers are going to fuel this growth. API explorers put the power of Web APIs in the hands of non-developers, allowing journalists, students, politicians, and any tech savvy Internet user to access the data and functionality available via APIs. ","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-explorer.png","width":"150","tags":"","category":"API Explorer","categoryslug":"documentation"},{"id":"244","name":"Appery.io","summary":"A new breed of mobile development platforms are emerging, and the leader of these is a product called Appery.io, from established technology company Exadel.  Using Appery.io developers and even non-developers can build cross-platform mobile applications using a GUI building environment.  Appery.io provides a suite of API connectors allowing for rapid mobile application development using APIs, with","details":"A new breed of mobile development platforms are emerging, and the leader of these is a product called Appery.io, from established technology company Exadel.  Using Appery.io developers and even non-developers can build cross-platform mobile applications using a GUI building environment.  Appery.io provides a suite of API connectors allowing for rapid mobile application development using APIs, with the ability to then deploy as native iOS and Android as well as web mobile applications.  API owners should consider working with Exadel to deploy an API connector for their companies API.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-appery.png","width":"150","tags":"","category":"Appery.io","categoryslug":"mobile"},{"id":"180","name":"Application Gallery","summary":"Complete, functioning applications built on an API is the end goal of any API owner.  Make sure and showcase all applications that are built on an API using an application showcase or directory.  App showcases are a great way to showcase not just applications built by the API owner, but also showcase the successful integrations of ecosystem partners and individual developers. Do not hesitate popul","details":"Complete, functioning applications built on an API is the end goal of any API owner.  Make sure and showcase all applications that are built on an API using an application showcase or directory.  App showcases are a great way to showcase not just applications built by the API owner, but also showcase the successful integrations of ecosystem partners and individual developers. Do not hesitate populating an application showcase with your own active or starter kit applications.  As with all of the API code, make sure and provide as liberal licensing as possible to ensure developers can be successful with use.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-app-icon.jpg","width":"150","tags":"","category":"Application Gallery","categoryslug":"code"},{"id":"169","name":"Application Manager","summary":"Many popular APIs are becoming application centric and provide developers with tools for managing multiple applications or development projects. API owners should consider how developers will be building applications on top of an API and consider that many will need multiple access keys for their separate applications or user groups.","details":"Many popular APIs are becoming application centric and provide developers with tools for managing multiple applications or development projects. API owners should consider how developers will be building applications on top of an API and consider that many will need multiple access keys for their separate applications or user groups.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-app-icon.jpg","width":"150","tags":"","category":"Application Manager","categoryslug":"developer-account"},{"id":"178","name":"Authentication Overview","summary":"Always provide an overview of what type of authentication is provided for an API.  Don&rsquo;t assume developers will know anything about Basic Auth or oAuth.  Walk developers through goals behind authentication, with links to tutorials regarding authentication technology. If an API employs oAuth, make sure and take extra special attention to provide clear instructions on how to use, as well as la","details":"Always provide an overview of what type of authentication is provided for an API.  Don&rsquo;t assume developers will know anything about Basic Auth or oAuth.  Walk developers through goals behind authentication, with links to tutorials regarding authentication technology. If an API employs oAuth, make sure and take extra special attention to provide clear instructions on how to use, as well as language specific code as part of your API SDKs.  After poor API documentation, oAuth integration is the number one stumbling point for API developers.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-authentication.png","width":"150","tags":"test","category":"Authentication Overview","categoryslug":"authentication"},{"id":"234","name":"Authentication Tester","summary":"When possible, provide a testing tool for authentication.  From key and Basic Auth to oAuth, allow developers to enter their keys or tokens and validate the credentials they are using, to make sure they are using the proper credentials.  A simple tester can provide quick validation that they are doing it right or show them where they are making a mistake, eliminating serious frustration while prog","details":"When possible, provide a testing tool for authentication.  From key and Basic Auth to oAuth, allow developers to enter their keys or tokens and validate the credentials they are using, to make sure they are using the proper credentials.  A simple tester can provide quick validation that they are doing it right or show them where they are making a mistake, eliminating serious frustration while programming.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-authentication-test.png","width":"150","tags":"","category":"Authentication Tester","categoryslug":"authentication"},{"id":"230","name":"Best Practices","summary":"An API delivers access to a business's valuable resources, and no doubt there will a level of conduct that will be expected of developers while accessing these resources.  While a developer is onboarding, this is the best time to provide a plain english introduction to the best practices around integrating with an API. Best practices should be an introductory lesson for developers of how to proper","details":"An API delivers access to a business's valuable resources, and no doubt there will a level of conduct that will be expected of developers while accessing these resources.  While a developer is onboarding, this is the best time to provide a plain english introduction to the best practices around integrating with an API. Best practices should be an introductory lesson for developers of how to properly integrate with an API, it should not dive into the legaleze and granular detail provided by terms of use.  Think of your best practices as a more friendlier, and easier to follow version of your terms of use--setting the proper tone of how a developer will use APIs as they are getting started.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-yingyang.jpg","width":"150","tags":"","category":"Best Practices","categoryslug":"onboarding"},{"id":"259","name":"Billing History","summary":"Obviously if an API is entirely free, billing history is not necessary, but if any tier of API requires paid access, provide clear and easy access to what a developer has been billed, allowing them to access and download their billing history. Provide tools for developers to update their billing and account information easily, as well as support for their billing questions.","details":"Obviously if an API is entirely free, billing history is not necessary, but if any tier of API requires paid access, provide clear and easy access to what a developer has been billed, allowing them to access and download their billing history. Provide tools for developers to update their billing and account information easily, as well as support for their billing questions.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-history.jpeg","width":"150","tags":"","category":"Billing History","categoryslug":"developer-account"},{"id":"123","name":"Blog w\/ RSS Feeds","summary":"An active blog can provide a quality SEO presence for an API, attracting developers and businesses to the API.  Secondarily a blog can provide essentials communications for the developer community.  While researching this white paper and reviewing 6000+ APIs, a blog is the number one way I could tell when an API is dead and nobody is supporting the community. A blog can easily provide the communic","details":"An active blog can provide a quality SEO presence for an API, attracting developers and businesses to the API.  Secondarily a blog can provide essentials communications for the developer community.  While researching this white paper and reviewing 6000+ APIs, a blog is the number one way I could tell when an API is dead and nobody is supporting the community. A blog can easily provide the communication to keep an API active and growing, while also be the barometer of whether developers should steer clear of an API. Make sure when deploying a blog, you don't forget the RSS feed!","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-blog-icon.png","width":"150","tags":"","category":"Blog w\/ RSS Feeds","categoryslug":"communications"},{"id":"149","name":"Branding","summary":"Along with the other business assets made available via an API ecosystem, the API owners brand is also being put on the on the line.  Branding Guidelines set the tone for how partners and developers can use the resources and assets made available via an API. The branding guidelines will provide a framework for attributing the API owner, how resources can be displayed and provide visual assets to s","details":"Along with the other business assets made available via an API ecosystem, the API owners brand is also being put on the on the line.  Branding Guidelines set the tone for how partners and developers can use the resources and assets made available via an API. The branding guidelines will provide a framework for attributing the API owner, how resources can be displayed and provide visual assets to support the company brand. As with terms of use and privacy policies, branding guidelines need protect the API owner but also provide developers with enough freedom to innovate.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-brand.png","width":"150","tags":"","category":"Branding","categoryslug":"legal"},{"id":"171","name":"Buttons","summary":"Buttons are shareable snippets of code that often share, syndicate or trigger a variety of events that benefit an API platform. Buttons play an important role in social media and social networks.  Consider how Twitter&rsquo;s share button has made Twitter a global communication platform or how the Digg button transformed social news. Embeddable buttons built on top of an API can significantly exte","details":"Buttons are shareable snippets of code that often share, syndicate or trigger a variety of events that benefit an API platform. Buttons play an important role in social media and social networks.  Consider how Twitter&rsquo;s share button has made Twitter a global communication platform or how the Digg button transformed social news. Embeddable buttons built on top of an API can significantly extend the reach of API resources.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-power-button.png","width":"150","tags":"","category":"Buttons","categoryslug":"embeddable"},{"id":"146","name":"Calendar","summary":"An active API will have many events that can be shared with its community, ranging from conferences, hackathons and meetups the API provider will be attending, to industry related events that developers can benefit from.  A published calendar is a great way to publicize these events, while also showing that the API is actively engaged within the API community and beyond.","details":"An active API will have many events that can be shared with its community, ranging from conferences, hackathons and meetups the API provider will be attending, to industry related events that developers can benefit from.  A published calendar is a great way to publicize these events, while also showing that the API is actively engaged within the API community and beyond.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-calendar.png","width":"150","tags":"","category":"Calendar","categoryslug":"direct-support"},{"id":"135","name":"Case Studies","summary":"APIs are all about partners and developers building new applications and finding innovative ways to integrate.  When anyone builds some notable application on top of an API, develop a case study. Case studies don&rsquo;t need to be novels, make them short, concise and showcase what a partner or individual developers has done. Case studies will stimulate other developers imaginations, while also sh","details":"APIs are all about partners and developers building new applications and finding innovative ways to integrate.  When anyone builds some notable application on top of an API, develop a case study. Case studies don&rsquo;t need to be novels, make them short, concise and showcase what a partner or individual developers has done. Case studies will stimulate other developers imaginations, while also showing the API is a viable platform that others are building on top of.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-case-study.png","width":"150","tags":"","category":"Case Studies","categoryslug":"resources"},{"id":"160","name":"Change Log","summary":"Knowing the past is a big part of understanding where things are in store for the future.  A change log should work in sync with the API roadmap building block, but provide much more detailed information about changes that have occurred with an API. Developers will not always pay attention to announced updates, but can use a change log as a guide for deciding what changes they need to make in thei","details":"Knowing the past is a big part of understanding where things are in store for the future.  A change log should work in sync with the API roadmap building block, but provide much more detailed information about changes that have occurred with an API. Developers will not always pay attention to announced updates, but can use a change log as a guide for deciding what changes they need to make in their applications and how they will use an API. The change log will be another building block to keep developers updated, and reduce overall support resources needed.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-recycling.jpg","width":"150","tags":"","category":"Change Log","categoryslug":"updates"},{"id":"125","name":"Code Libraries","summary":"Working code samples in all the top programming languages are common place in the most successful APIs. Documentation will describe in a general way, how to use an API, but code samples will speak in the specific language of developers. Make sure and provide a wide variety of code samples, not just what the API development team uses.  Consider popular web languages like PHP, Python and Ruby as wel","details":"Working code samples in all the top programming languages are common place in the most successful APIs. Documentation will describe in a general way, how to use an API, but code samples will speak in the specific language of developers. Make sure and provide a wide variety of code samples, not just what the API development team uses.  Consider popular web languages like PHP, Python and Ruby as well as lesser languages like ColdFusion and Perl.  Make sure and consider enterprise developers with Java, C# and even VisualBasic.  Then consider JavaScript and the popular JS platform NodeJS, which will feed into later building blocks of a healthy embeddable strategy. Remember your developers may not speak HTTP and REST, but will speak one of these programming languages fluently, so make code samples as inclusive as possible, reaching the widest possible audience.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-code.png","width":"150","tags":"","category":"Code Libraries","categoryslug":"code"},{"id":"243","name":"Cross Platform Mobile Development Tools","summary":"One way to address the iOS, Android and HTML5 building blocks all at once is using cross-platform mobile development platforms like PhoneGap and Trigger.io.  These platforms provide a suite of mobile development tools that allow developers to build mobile applications that can be deployed as native apps for iOS and Android while also providing mobile web versions.  Providing API developers with Ph","details":"One way to address the iOS, Android and HTML5 building blocks all at once is using cross-platform mobile development platforms like PhoneGap and Trigger.io.  These platforms provide a suite of mobile development tools that allow developers to build mobile applications that can be deployed as native apps for iOS and Android while also providing mobile web versions.  Providing API developers with PhoneGap and \/ or Trigger.io resources, API owners can rapidly grow the number of  mobile apps developed on top of an API, with fewer resources.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-mobile-cross-platform.png","width":"0","tags":"","category":"Cross Platform Mobile Development Tools","categoryslug":"code"},{"id":"216","name":"Developer Badges","summary":"Badges are common for displaying content and resources delivered via an API and allow these assets to be embedded on any website or application. API platforms like LinkedIn and Google have successfully employed API driven profile badges allowing any user to take advantage of the power of an API, and grow a healthy API embeddable strategy.","details":"Badges are common for displaying content and resources delivered via an API and allow these assets to be embedded on any website or application. API platforms like LinkedIn and Google have successfully employed API driven profile badges allowing any user to take advantage of the power of an API, and grow a healthy API embeddable strategy.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-badges.png","width":"0","tags":"","category":"Developer Badges","categoryslug":"embeddable"},{"id":"256","name":"Developer Dashboard","summary":"Much like the landing page for the entire API platform, developers should have a single dashboard for getting at all their tools, metrics and information they need to successfully manage their usage. Developers should not have to ask, or look around for their account and access information--they should have a single place to obtain what they need.","details":"Much like the landing page for the entire API platform, developers should have a single dashboard for getting at all their tools, metrics and information they need to successfully manage their usage. Developers should not have to ask, or look around for their account and access information--they should have a single place to obtain what they need.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-dashboard.png","width":"150","tags":"","category":"Developer Dashboard","categoryslug":"developer-account"},{"id":"120","name":"Documentaton","summary":"Quality API documentation is the gateway to a successful API.  API documentation needs to be complete, yet simple--a very difficult balance to achieve.  This balance takes work and will take the work of more than one individual on an API development team to make happen. API documentation can be written by developers of the API, but additional edits should be made by developers who were not respons","details":"Quality API documentation is the gateway to a successful API.  API documentation needs to be complete, yet simple--a very difficult balance to achieve.  This balance takes work and will take the work of more than one individual on an API development team to make happen. API documentation can be written by developers of the API, but additional edits should be made by developers who were not responsible for deploying the API.  As a developer, it&rsquo;s easy to overlook parameters and other details that developers have made assumptions about.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-documentation.png","width":"150","tags":"","category":"Documentaton","categoryslug":"documentation"},{"id":"166","name":"Email","summary":"Sometimes your API building blocks are not complex tools or documentation. They can be as simple as an email address. Of course simply listing an email address as part of your API community is not where it ends. Don't list an email for developers, partners, or support if nobody answers it. Make sure and have a plan for any email addresses you use throughout your API community. Make them meaningful","details":"Sometimes your API building blocks are not complex tools or documentation. They can be as simple as an email address. Of course simply listing an email address as part of your API community is not where it ends. Don't list an email for developers, partners, or support if nobody answers it. Make sure and have a plan for any email addresses you use throughout your API community. Make them meaningful and route to the right people. Make sure your email accounts are responsive, otherwise people will immediately go to your forums with negative feedback. Consider an email account to provide support for your API community.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-email.png","width":"150","tags":"","category":"Email","categoryslug":"communications"},{"id":"249","name":"Email Newsletter","summary":"An email newsletter is a proven communication tool beyond APIs, and while many developers will not be open to receiving regular emails about an API, there are some developers who are still  receptive to this format. As an API owner, there is also a positive effect from having to gather thoughts each week for an email newsletter that goes beyond just communicating with the developer community.","details":"An email newsletter is a proven communication tool beyond APIs, and while many developers will not be open to receiving regular emails about an API, there are some developers who are still  receptive to this format. As an API owner, there is also a positive effect from having to gather thoughts each week for an email newsletter that goes beyond just communicating with the developer community.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-email-newsletter.png","width":"0","tags":"","category":"Email Newsletter","categoryslug":"communications"},{"id":"232","name":"Error Response Codes","summary":"Errors are an inevitable part of API integration, and providing not only a robust set of clear and meaningful API error response codes, but a clear listing of these codes for developers to follow and learn from is essential. API errors are directly related to frustration during developer integration, the more friendlier and meaningful they are, the greater the chance a developer will move forward ","details":"Errors are an inevitable part of API integration, and providing not only a robust set of clear and meaningful API error response codes, but a clear listing of these codes for developers to follow and learn from is essential. API errors are directly related to frustration during developer integration, the more friendlier and meaningful they are, the greater the chance a developer will move forward after encountering an error.  Put a lot of consideration into your error responses and the documentation that educates developers.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-error.png","width":"150","tags":"","category":"Error Response Codes","categoryslug":"documentation"},{"id":"219","name":"Facebook","summary":"Like LinkedIn, Facebook carries a great deal of social weight when it comes to working with developers.  Depending on your target developer audience, Facebook may or may not make sense as part of your communication strategy.  Facebook is larger than just the individual social network accounts, and a Facebook Page can be a great way for API owners to attract and engage with developers who are build","details":"Like LinkedIn, Facebook carries a great deal of social weight when it comes to working with developers.  Depending on your target developer audience, Facebook may or may not make sense as part of your communication strategy.  Facebook is larger than just the individual social network accounts, and a Facebook Page can be a great way for API owners to attract and engage with developers who are building applications.  Consider the Facebook effect when assembling API communication building blocks.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-facebook.png","width":"0","tags":"","category":"Facebook","categoryslug":"communications"},{"id":"132","name":"FAQ","summary":"FAQs are a standard in many online platforms, not just APIs.  API owners will know what the common questions developers ask when onboarding with an API, or learning advanced concepts. These questions, with relevant answers need to be published where developers can quickly find them.  An FAQ building block is a great way to address these questions in a self-service way--make sure and keep the page ","details":"FAQs are a standard in many online platforms, not just APIs.  API owners will know what the common questions developers ask when onboarding with an API, or learning advanced concepts. These questions, with relevant answers need to be published where developers can quickly find them.  An FAQ building block is a great way to address these questions in a self-service way--make sure and keep the page a living document, adding new questions received through other support channels, as well as keeping older questions fresh.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-question-mark.png","width":"150","tags":"","category":"FAQ","categoryslug":"onboarding"},{"id":"131","name":"Forum","summary":"Forums have become an essential building block in API communities for self-service support.  A well moderated, active forum can evolve an APIs development area into an actual community. All forum communities will require the API owner to engage developers, keeping conversations active and questions answered, but with the right developers your forum can become self regulating--with opportunities fo","details":"Forums have become an essential building block in API communities for self-service support.  A well moderated, active forum can evolve an APIs development area into an actual community. All forum communities will require the API owner to engage developers, keeping conversations active and questions answered, but with the right developers your forum can become self regulating--with opportunities for more senior developers to answer the questions of newer, more junior users, providing potentially free resources for an API owner.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-forum.png","width":"0","tags":"","category":"Forum","categoryslug":"self-service-support"},{"id":"188","name":"Getting Started","summary":"API integration.  Developer onboarding is dependent on laying out simple, clear steps for developers on how to register, authenticate, access documentation and code samples, get support and any other details that are essential to API integration. A quality getting started guide should be easily accessed from the API landing page, and kept simple.  Try to only provide what a developer needs to get ","details":"API integration.  Developer onboarding is dependent on laying out simple, clear steps for developers on how to register, authenticate, access documentation and code samples, get support and any other details that are essential to API integration. A quality getting started guide should be easily accessed from the API landing page, and kept simple.  Try to only provide what a developer needs to get started with as few possible steps as possible.  The getting started will not just make developer onboarding frictionless, it will speed up onboarding, increasing the chance a developer&rsquo;s successful integration.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-running.png","width":"150","tags":"","category":"Getting Started","categoryslug":"onboarding"},{"id":"185","name":"Github","summary":"GitHub is a social coding platform allowing developers to publicly or privately build code repositories and interact with other developers around these repositories--providing the ability to download or fork a repository, as well as contribute back, resulting in a collaborative environment for software development. Github provides an excellent platform for API owners to engage with developers outs","details":"GitHub is a social coding platform allowing developers to publicly or privately build code repositories and interact with other developers around these repositories--providing the ability to download or fork a repository, as well as contribute back, resulting in a collaborative environment for software development. Github provides an excellent platform for API owners to engage with developers outside of a local API ecosystem.  Developers are already actively pushing code and interacting on Github, making it a perfect opportunity for API owners.  It is standard practice for API owners to establish Github repositories for all SDKs, starter projects and Platform Development Kits (PDK), as well as deploy Github Gists for actively displaying all code samples. Beyond using Github for pushing code, as stated above in the self-service API registration building block, Github also provides a preferred account integration for API developers to use that provides opportunities for healthy social interactions amongst API ecosystem developers.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-github.jpg","width":"150","tags":"","category":"Github","categoryslug":"code"},{"id":"248","name":"Google+","summary":"While Google+ is not as popular as Twitter or Facebook, it does have as many active users as LinkedIn these days, and with considerable SEO benefits, it is recommended that you consider Google&rsquo;s social network as one of the API communication building blocks.  Google+ has a tremendous amount of network effects beyond just the social network and Google SEO.  Tools like Google Hangouts can be u","details":"While Google+ is not as popular as Twitter or Facebook, it does have as many active users as LinkedIn these days, and with considerable SEO benefits, it is recommended that you consider Google&rsquo;s social network as one of the API communication building blocks.  Google+ has a tremendous amount of network effects beyond just the social network and Google SEO.  Tools like Google Hangouts can be used as part of API open office hours, and events can be used to coordinate API focused gatherings.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-google-plus.png","width":"150","tags":"","category":"Google+","categoryslug":"communications"},{"id":"161","name":"How-to Guides","summary":"Many developers can get up and running without any help at all.  Other developers need a helping hand, showing them how to use the API and put code samples and SDKs to use.  How-to guides can provide the essential resources for developers to get up and going with an API. Start with common integration scenarios and build how-to guides around them, then as new ways of integrations emerge create fres","details":"Many developers can get up and running without any help at all.  Other developers need a helping hand, showing them how to use the API and put code samples and SDKs to use.  How-to guides can provide the essential resources for developers to get up and going with an API. Start with common integration scenarios and build how-to guides around them, then as new ways of integrations emerge create fresh how-to guides using these new ways of taking advantage of the API.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-how-to-guide.png","width":"150","tags":"","category":"How-to Guides","categoryslug":"resources"},{"id":"242","name":"HTML5","summary":"While the native app vs. HTML5 app development battle rages on, API owners have to closely pay attention to HTML5 as a viable alternative offering for their API developers, right alongside iOS and Android.  For many web developers, HTML5 is a natural transition to mobile development--a factor that may tip the future toward more HTML5 mobile implementations. Big players like Apple, Facebook and Goo","details":"While the native app vs. HTML5 app development battle rages on, API owners have to closely pay attention to HTML5 as a viable alternative offering for their API developers, right alongside iOS and Android.  For many web developers, HTML5 is a natural transition to mobile development--a factor that may tip the future toward more HTML5 mobile implementations. Big players like Apple, Facebook and Google are investing heavily in the future being HTML5, which sends the signal to API owners, that they should do the same.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-html5.png","width":"150","tags":"","category":"HTML5","categoryslug":"mobile"},{"id":"138","name":"Ideas","summary":"As an API owner you will have ideas flowing from all directions--internally, from partners and submissions from the API community. Establishing a revolving door for ideas is important, if they don&rsquo;t take hold internally and immediately get used, put them out to the community and showcase them in an idea forum. Encourage developers to submit their own, vote on, and comment or take ownership o","details":"As an API owner you will have ideas flowing from all directions--internally, from partners and submissions from the API community. Establishing a revolving door for ideas is important, if they don&rsquo;t take hold internally and immediately get used, put them out to the community and showcase them in an idea forum. Encourage developers to submit their own, vote on, and comment or take ownership of ideas.  Idea showcases stimulate developers, planting the seeds of innovation every API owner wants to see thrive in their ecosystems.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-light-bulb-bright.png","width":"150","tags":"","category":"Ideas","categoryslug":"research--development"},{"id":"233","name":"Interactive Documentation","summary":"There is a new movement in API documentation, one that is moving beyond static, often boring documentation and into a new realm where API documentation is live and interactive.  Following in the footsteps of API explorers these new interactive documentation formats like Swagger and Mashery I\/O Docs, allow developers to authenticate, navigate endpoints and make requests with live responses returned","details":"There is a new movement in API documentation, one that is moving beyond static, often boring documentation and into a new realm where API documentation is live and interactive.  Following in the footsteps of API explorers these new interactive documentation formats like Swagger and Mashery I\/O Docs, allow developers to authenticate, navigate endpoints and make requests with live responses returned. In a little over a year, interactive API documentation has gone from a new innovation of a select few APIs, to being a standard offering among many of the leading APIs in the space.  There is no better way to get your developers acquainted with an API, than allowing them to interact with your API while reading documentation--turning API documentation into a hands on experience.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-documentation-interactive.png","width":"150","tags":"","category":"Interactive Documentation","categoryslug":"documentation"},{"id":"239","name":"iOS","summary":"The trends is clear.  Apple is the dominant platform for mobile application development.  API owners need to have a clear understanding of what iOS developers are needing for both iPhone and iPad application development.  When possible, provide iOS specific code samples, SDKs and other resources iOS developers can employ to make their API integrations successful.","details":"The trends is clear.  Apple is the dominant platform for mobile application development.  API owners need to have a clear understanding of what iOS developers are needing for both iPhone and iPad application development.  When possible, provide iOS specific code samples, SDKs and other resources iOS developers can employ to make their API integrations successful.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-iphone.png","width":"150","tags":"","category":"iOS","categoryslug":"mobile"},{"id":"164","name":"Labs","summary":"A labs environment for an API can be a center of innovation and inspiration for your API ecosystem. A labs environment ususally showcase experiemental and non-production projects built around your API. Labs can showcase experiemental and research development by your internal development and business staff. Encouraging internal staff members to take time and innovate around your API ccan increase t","details":"A labs environment for an API can be a center of innovation and inspiration for your API ecosystem. A labs environment ususally showcase experiemental and non-production projects built around your API. Labs can showcase experiemental and research development by your internal development and business staff. Encouraging internal staff members to take time and innovate around your API ccan increase their awareness of real-llife problems faced with integrating with the API. Showcasing the best of projects by your staff can also boost moral among your staff and introduce a new set of goals to achieve in their job. You may also considering exending Labs to your API development and partner community. You may need to review submissions and only showcase the best of breed. A community lab is a great way to encourage outside research &amp; development, and build community within your API ecosystem. The are many incarnations of what an API Labs could be, spend some time and take a look at what a labs at your company may look like.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-app-development.png","width":"150","tags":"","category":"Labs","categoryslug":"research--development"},{"id":"158","name":"LinkedIn","summary":"LinkedIn is a powerful business communications platform.  While LinkedIn is not the preferred platform of many open API developers, it is the preferred platform of enterprise developers.  As an API communications building block, an active presence on LinkedIn is recommended for API owners, it can add a healthy dimension to your communication strategy and reach older, more established developers th","details":"LinkedIn is a powerful business communications platform.  While LinkedIn is not the preferred platform of many open API developers, it is the preferred platform of enterprise developers.  As an API communications building block, an active presence on LinkedIn is recommended for API owners, it can add a healthy dimension to your communication strategy and reach older, more established developers that may not always be considered when deploying public APIs.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-linkedin.png","width":"0","tags":"","category":"LinkedIn","categoryslug":"communications"},{"id":"231","name":"List of Endpoints","summary":"Before a developer is thrown into the full detail of API documentation, it helps to introduce them to all available API endpoints, getting them acquainted with the resources available.  A simple listing of all endpoints provides a quick introduction, that will prime developers for a deeper dive. After reviewing all API endpoints a developer can start to imagine how their application will integrate","details":"Before a developer is thrown into the full detail of API documentation, it helps to introduce them to all available API endpoints, getting them acquainted with the resources available.  A simple listing of all endpoints provides a quick introduction, that will prime developers for a deeper dive. After reviewing all API endpoints a developer can start to imagine how their application will integrate with an API, further understanding the value the API will bring to their application.  Sometimes it's hard to see the 100K view of an API from regular documentation, start with just listing the API endpoints.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-list.png","width":"150","tags":"","category":"List of Endpoints","categoryslug":"documentation"},{"id":"246","name":"Office Hours","summary":"Open office hours is a great way to provide direct support for developers, in a controlled and sustainable format for API owners.  Many popular APIs post office hours each week, giving developers an open time they can engage with support representatives via Skype, Google Hangouts or sometimes even in person. Consider the possibility of using API open office hours to support an API community.","details":"Open office hours is a great way to provide direct support for developers, in a controlled and sustainable format for API owners.  Many popular APIs post office hours each week, giving developers an open time they can engage with support representatives via Skype, Google Hangouts or sometimes even in person. Consider the possibility of using API open office hours to support an API community.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-clock.jpeg","width":"150","tags":"","category":"Office Hours","categoryslug":"direct-support"},{"id":"238","name":"Open Source","summary":"An API is inherently an external part of a company.  The documention, code samples, SDKs, starter kits, platform development kits and any code related to an API, should be considered external intellectual property and licensed accordingly.  Consider open sourcing all of the code associated with an API. Open source will fuel the innovation that is already present in API ecosystems, further reducing","details":"An API is inherently an external part of a company.  The documention, code samples, SDKs, starter kits, platform development kits and any code related to an API, should be considered external intellectual property and licensed accordingly.  Consider open sourcing all of the code associated with an API. Open source will fuel the innovation that is already present in API ecosystems, further reducing the friction experienced by developers in successfully integrating their applications and businesses with an API.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-open-source.png","width":"150","tags":"","category":"Open Source","categoryslug":"code"},{"id":"253","name":"Opportunities","summary":"After you&rsquo;ve managed developer communities for a while you will find developers are very open to suggestion and pointing them in the right direction.  Some API owners are creating sections of their API communities that showcase opportunities for developers to start projects and build applications. A dedicated opportunities page, bundled with an idea showcase and a transparent roadmap will he","details":"After you&rsquo;ve managed developer communities for a while you will find developers are very open to suggestion and pointing them in the right direction.  Some API owners are creating sections of their API communities that showcase opportunities for developers to start projects and build applications. A dedicated opportunities page, bundled with an idea showcase and a transparent roadmap will help keep developer activity in line with company goals.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-exlamation-point.gif","width":"150","tags":"","category":"Opportunities","categoryslug":"research--development"},{"id":"247","name":"Phone","summary":"Much like email, a phone number can be a solid choice for API developer support.  Especially if you have a dedicated, partner target audience.  Phone can be the instant gratification that developers need when they hit problems, get their questions answered and move forward with their API integration. Not all API providers will have the resources for phone support, but in some circumstances it will","details":"Much like email, a phone number can be a solid choice for API developer support.  Especially if you have a dedicated, partner target audience.  Phone can be the instant gratification that developers need when they hit problems, get their questions answered and move forward with their API integration. Not all API providers will have the resources for phone support, but in some circumstances it will do the trick.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-phone.jpeg","width":"150","tags":"","category":"Phone","categoryslug":"direct-support"},{"id":"237","name":"Platform Development Kits (PDK)","summary":"In the era of cloud computing there are numerous Platforms as a Service (PaaS) that allow developers to integrate with existing, thriving ecosystems like Facebook or Salesforce.  While planning code related building blocks consider these platforms, and the possibility of providing platform specific development kits. Every API that deploys will suffer from a lack of developers.  Building Platform D","details":"In the era of cloud computing there are numerous Platforms as a Service (PaaS) that allow developers to integrate with existing, thriving ecosystems like Facebook or Salesforce.  While planning code related building blocks consider these platforms, and the possibility of providing platform specific development kits. Every API that deploys will suffer from a lack of developers.  Building Platform Development Kits (PDK) can help an API go from zero users to an active community of developers by embracing these existing providers.  There are many different incarnations of these platforms, such as Facebook, Wordpress, Drupal, Salesforce and Heroku--spend the time and get to know which platforms may best suit your API.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-platform.png","width":"150","tags":"","category":"Platform Development Kits (PDK)","categoryslug":"code"},{"id":"191","name":"Pricing","summary":"Pricing doesn&rsquo;t always apply to APIs.  It&rsquo;s very common to provide API service for free.  However, whether or not you charge for an API, you should clarify this for developers. Provide a pricing page, outlining what a developer gets for free and provide clear pricing for any other service levels, so developers will know what to expect as their usage grows. Even if the API is free, API ","details":"Pricing doesn&rsquo;t always apply to APIs.  It&rsquo;s very common to provide API service for free.  However, whether or not you charge for an API, you should clarify this for developers. Provide a pricing page, outlining what a developer gets for free and provide clear pricing for any other service levels, so developers will know what to expect as their usage grows. Even if the API is free, API owners should put thought into the future of the platform, set realistic expectations of how the platform will generate revenue to say in operation.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-dollar-sign.jpg","width":"150","tags":"","category":"Pricing","categoryslug":"service-levels"},{"id":"165","name":"Privacy","summary":"Privacy policies protect the rights of partners, developers and platform users while also protecting the API owner from damaging activity via the API platform. Like API terms of use, privacy policies need to strike a balance and protect everyone involved, but also allow for innovation and commercial activity.","details":"Privacy policies protect the rights of partners, developers and platform users while also protecting the API owner from damaging activity via the API platform. Like API terms of use, privacy policies need to strike a balance and protect everyone involved, but also allow for innovation and commercial activity.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-privacy.png","width":"150","tags":"","category":"Privacy","categoryslug":"legal"},{"id":"254","name":"Production","summary":"When planning an API, consider if all deployments need to have access to live data in real-time or there is the need to require developers to request for separate production access for their API applications. In line with the sandbox building block, a separate API production environment can make for a much healthier API ecosystem.","details":"When planning an API, consider if all deployments need to have access to live data in real-time or there is the need to require developers to request for separate production access for their API applications. In line with the sandbox building block, a separate API production environment can make for a much healthier API ecosystem.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-production.png","width":"150","tags":"","category":"Production","categoryslug":"environment"},{"id":"175","name":"Rate Limits","summary":"Rate limiting is the industry standard for controlling what a developer can do with an API and reducing abuse on the platform.  As with service tiers and pricing, put a considerable amount of thought into API rate limits. Make sure rate limits are in sync with service tiers, with pricing clearly posted, as well as proper relief valves so developers do not end up frustrated.  Rate limits are meant ","details":"Rate limiting is the industry standard for controlling what a developer can do with an API and reducing abuse on the platform.  As with service tiers and pricing, put a considerable amount of thought into API rate limits. Make sure rate limits are in sync with service tiers, with pricing clearly posted, as well as proper relief valves so developers do not end up frustrated.  Rate limits are meant to prevent abuse, not stifle innovation--put a lot of thought into the rate limits, and actively evaluate them to make sure they are achieving the objectives of the API platform.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-speed-limit.jpeg","width":"150","tags":"","category":"Rate Limits","categoryslug":"service-levels"},{"id":"255","name":"Reset Password","summary":"The need to reset an account password access is pretty standard operations for any online platform.  Provide the necessary tools for developers to gain access to their account if they lose their password.","details":"The need to reset an account password access is pretty standard operations for any online platform.  Provide the necessary tools for developers to gain access to their account if they lose their password.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-reset.jpeg","width":"150","tags":"","category":"Reset Password","categoryslug":"developer-account"},{"id":"141","name":"Roadmap","summary":"API owners are asking developers to invest in building applications on their platform.  This is asking for a lot of trust, and the best way an API owner can build this trust with its developers is with a transparent roadmap. API roadmaps are usually a simple, bulleted list, derived from the APIs own internal roadmap, showing what the future holds for the platform.  Transparency around an APIs road","details":"API owners are asking developers to invest in building applications on their platform.  This is asking for a lot of trust, and the best way an API owner can build this trust with its developers is with a transparent roadmap. API roadmaps are usually a simple, bulleted list, derived from the APIs own internal roadmap, showing what the future holds for the platform.  Transparency around an APIs roadmap is a tough balance, since you don&rsquo;t want to give away too much, alerting your competitors, but your developer ecosystem needs to know what&rsquo;s next. API owners need to find a balance that works for their company, and maintain an active roadmap outlining where the platform is headed.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-highway.png","width":"150","tags":"","category":"Roadmap","categoryslug":"updates"},{"id":"190","name":"Sandbox","summary":"With the sensitive information available via many APIs, providing developers a sandbox environment to develop and test their code might be wise idea. Sandboxes environments will increase the overall cost of an API deployment, but can reduce headaches for developers and can significantly reduce support overhead. Consider the value of a sandbox when planning an API.","details":"With the sensitive information available via many APIs, providing developers a sandbox environment to develop and test their code might be wise idea. Sandboxes environments will increase the overall cost of an API deployment, but can reduce headaches for developers and can significantly reduce support overhead. Consider the value of a sandbox when planning an API.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-sandbox.jpeg","width":"150","tags":"","category":"Sandbox","categoryslug":"environment"},{"id":"198","name":"Self-Service Registration","summary":"You&rsquo;ve launched an API to stimulate innovation around your company's resources.  Don&rsquo;t stand in the way of developers innovating.  Provide self-service registration for developers to gain access. Even if an API is not meant to be public, there are plenty of ways to provide self-service access while still securing the API--such as using invitation codes or limited entry service tiers, t","details":"You&rsquo;ve launched an API to stimulate innovation around your company's resources.  Don&rsquo;t stand in the way of developers innovating.  Provide self-service registration for developers to gain access. Even if an API is not meant to be public, there are plenty of ways to provide self-service access while still securing the API--such as using invitation codes or limited entry service tiers, that limit access when developers first register.  Innovation around an API will occur around the clock, don&rsquo;t make developers wait for access. Another area to consider when trying to reduce friction during registration, is allowing developers to register using their existing social network accounts like Twitter, Facebook and Google.   When employing this option, make sure and include Github, which is the most logical of social networks for developers to use when registering for an API--Github allows the API owner to stay in tune with the profile of a developer that is most relevant to APIs and programming, and not just their everyday social life.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-hand-wrench.jpg","width":"150","tags":"","category":"Self-Service Registration","categoryslug":"onboarding"},{"id":"250","name":"Service Tiers","summary":"A well planned API will have multiple service tiers for developers to take advantage of.  Before developers begin integrating their applications with an API, they need to have a clear understanding of what services are available to them. Successful API owners need to openly communicate all service tiers available, and provide simple and comprehensive descriptions of each.  With no surprises on ser","details":"A well planned API will have multiple service tiers for developers to take advantage of.  Before developers begin integrating their applications with an API, they need to have a clear understanding of what services are available to them. Successful API owners need to openly communicate all service tiers available, and provide simple and comprehensive descriptions of each.  With no surprises on services available to them, developers can confidently build their applications on top of an API, understanding at which levels they will need to adjust their integration to take advantage of new levels of a platform.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-tiers.jpg","width":"150","tags":"","category":"Service Tiers","categoryslug":"service-levels"},{"id":"235","name":"Software Development Kits","summary":"Software Development Kits (SDK) are the next step in providing code for developers, after basic code samples. SDKs are more complete code libraries that usually include authentication and production ready objects, that developers can use after they are more familiar with an API and are ready for integration. Just like with code samples, SDKs should be provided in as many common programming languag","details":"Software Development Kits (SDK) are the next step in providing code for developers, after basic code samples. SDKs are more complete code libraries that usually include authentication and production ready objects, that developers can use after they are more familiar with an API and are ready for integration. Just like with code samples, SDKs should be provided in as many common programming languages as possible.  Code samples will help developers understand an API, while SDKs will actually facilitate their integration of an API into their application.  When providing SDKs make sure and consider a software licensing that gives your developers as much flexibility as possible in their commercial products.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-sdk.png","width":"0","tags":"","category":"Software Development Kits","categoryslug":"code"},{"id":"245","name":"Stack Exchange","summary":"Developers do not always rely on the forum or support of a single API.  They have long established their own communities for support across many public APIs, programming languages and platforms.  The leading open forum for this developer activity is Stack Exchange.Stack Exchange provides a community for developers of all types to share knowledge and answer questions encountered during development ","details":"Developers do not always rely on the forum or support of a single API.  They have long established their own communities for support across many public APIs, programming languages and platforms.  The leading open forum for this developer activity is Stack Exchange.Stack Exchange provides a community for developers of all types to share knowledge and answer questions encountered during development of any type.  API owners need to actively monitor and participate in conversations on Stack Exchange and not expect developers to always engage on their own local API forum. Some API ecosystems like Foursquare and Facebook have even migrated their entire forum to a dedicated Stack Exchange forum, in recognition of the value developers put into the Stack Exchange.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-stack-exchange.png","width":"150","tags":"","category":"Stack Exchange","categoryslug":"self-service-support"},{"id":"236","name":"Starter Projects","summary":"Many API owners are going beyond just code samples and generic SDKs for their API ecosystems and providing open-source, private label applications built on top of an API that developers can download, modify and deploy. These projects go by many names, but are commonly known as starter kits or projects.  Starter kits can act as code samples, and may contain a version of an SDK, but provide a comple","details":"Many API owners are going beyond just code samples and generic SDKs for their API ecosystems and providing open-source, private label applications built on top of an API that developers can download, modify and deploy. These projects go by many names, but are commonly known as starter kits or projects.  Starter kits can act as code samples, and may contain a version of an SDK, but provide a complete application that reflects common integrations with an API.  As with samples and SDKs, start kits will speed up integrations, providing developers with the path of least resistance from registration to active API integration.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-starter-kit.png","width":"150","tags":"","category":"Starter Projects","categoryslug":"code"},{"id":"143","name":"Status Dashboard","summary":"API owners are asking developers to invest in building applications on their platform.  This is asking for a lot of trust, and the best way an API owner can build this trust with its developers is with a transparent roadmap.  API roadmaps are usually a simple, bulleted list, derived from the APIs own internal roadmap, showing what the future holds for the platform. Transparency around an APIs road","details":"API owners are asking developers to invest in building applications on their platform.  This is asking for a lot of trust, and the best way an API owner can build this trust with its developers is with a transparent roadmap.  API roadmaps are usually a simple, bulleted list, derived from the APIs own internal roadmap, showing what the future holds for the platform. Transparency around an APIs roadmap is a tough balance, since you don&rsquo;t want to give away too much, alerting your competitors, but your developer ecosystem needs to know what&rsquo;s next.  API owners need to find a balance that works for their company, and maintain an active roadmap outlining where the platform is headed.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-status-dashboard.png","width":"150","tags":"","category":"Status Dashboard","categoryslug":"updates"},{"id":"150","name":"Terms of Use \/ Conditions","summary":"Terms of Use provide a legal framework for developers to operate within.  They set the stage for the business development relationships that will occur within an API ecosystem. TOS should protect the API owners company, assets and brand, but should also provide assurances for developers who are building businesses on top of an API. Make sure an APIs TOS pass insepection with the lawyers, but also ","details":"Terms of Use provide a legal framework for developers to operate within.  They set the stage for the business development relationships that will occur within an API ecosystem. TOS should protect the API owners company, assets and brand, but should also provide assurances for developers who are building businesses on top of an API. Make sure an APIs TOS pass insepection with the lawyers, but also strike a healthy balance within the ecosystem and foster innovation.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-terms-conditions.png","width":"150","tags":"","category":"Terms of Use \/ Conditions","categoryslug":"legal"},{"id":"142","name":"Ticket System","summary":"Providing developers with a support ticketing tool, using a custom system, or via a popular platform like Zendesk, can be the healthy way to support the needs of an API ecosystem. Not all developers will want to publicly post their problems, and support tickets can be a very organized way to handle the direct support needs of developers, allowing API owners to respond quickly to easy questions, bu","details":"Providing developers with a support ticketing tool, using a custom system, or via a popular platform like Zendesk, can be the healthy way to support the needs of an API ecosystem. Not all developers will want to publicly post their problems, and support tickets can be a very organized way to handle the direct support needs of developers, allowing API owners to respond quickly to easy questions, but also allowing them to organize larger scope items into lists that can be used in API product development, providing a direct link between developer support and the API roadmap.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-ticket-system.png","width":"150","tags":"","category":"Ticket System","categoryslug":"direct-support"},{"id":"159","name":"Twitter","summary":"Twitter as a communication platform, much like a blog is a great way to establish an active presence for an API, providing updates about API endpoints, build relationships with developers and establish partnerships with other API providers.  Also in line with a blog, it can be the communication tool that demonstrates your supporting your API, while an out of date Twitter stream can show that nobod","details":"Twitter as a communication platform, much like a blog is a great way to establish an active presence for an API, providing updates about API endpoints, build relationships with developers and establish partnerships with other API providers.  Also in line with a blog, it can be the communication tool that demonstrates your supporting your API, while an out of date Twitter stream can show that nobody is home to support an API--sending the signal developers should steer clear of the platform.","image":"","width":"150","tags":"","category":"Twitter","categoryslug":"communications"},{"id":"258","name":"Usage Logs & Analytics","summary":"Rate limiting will be part of any API platform, without some sort of usage log and analytics showing developers where they stand, the rate limits will cause nothing but frustration. Clearly show developers where they are at with daily, weekly or monthly API usage and provide proper relief valves allowing them to scale their usage properly.","details":"Rate limiting will be part of any API platform, without some sort of usage log and analytics showing developers where they stand, the rate limits will cause nothing but frustration. Clearly show developers where they are at with daily, weekly or monthly API usage and provide proper relief valves allowing them to scale their usage properly.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-analytics-2.png","width":"150","tags":"","category":"Usage Logs & Analytics","categoryslug":"developer-account"},{"id":"252","name":"Webinars","summary":"Not everyone likes to read how-to guides or case studies.  Many developers prefer to have a visual walk through of how to integrate with an API or the case studies of how other developers have built on top of an API.  When appropriate, make webinars and videos around your how-to guides and case studies. If video productions of case studies and how-to guides are standard operating procedure, the wo","details":"Not everyone likes to read how-to guides or case studies.  Many developers prefer to have a visual walk through of how to integrate with an API or the case studies of how other developers have built on top of an API.  When appropriate, make webinars and videos around your how-to guides and case studies. If video productions of case studies and how-to guides are standard operating procedure, the work can occur while you produce the core paper.  Youtube and Slideshare are great platforms for distributing webinars and videos of API resources.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-webinar.png","width":"150","tags":"","category":"Webinars","categoryslug":"resources"},{"id":"136","name":"White Papers","summary":"White papers demonstrate domain and industry expertise.  APIs are about exposing valuable business resources and assets of a company. Producing white papers can actively demonstrate the expertise a company possess and how the API resources the company offers can solve problems and provide sounds solutions for an industry and business sector. Make white papers a regular part of the API content crea","details":"White papers demonstrate domain and industry expertise.  APIs are about exposing valuable business resources and assets of a company. Producing white papers can actively demonstrate the expertise a company possess and how the API resources the company offers can solve problems and provide sounds solutions for an industry and business sector. Make white papers a regular part of the API content creation, and when ready, publish to the API area as well as syndicate across the web.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-documentation.png","width":"150","tags":"","category":"White Papers","categoryslug":"resources"},{"id":"170","name":"Widgets","summary":"Widgets are highly functional, API driven JavaScript tools that provide portable applications that can be embedded on any website or application. API widgets provide tools any API user can deploy, and developers can reverse engineer, modify and extend to meet their needs. Widgets really establish an advanced API embeddable strategy and can deliver the value of an API across the Internet.","details":"Widgets are highly functional, API driven JavaScript tools that provide portable applications that can be embedded on any website or application. API widgets provide tools any API user can deploy, and developers can reverse engineer, modify and extend to meet their needs. Widgets really establish an advanced API embeddable strategy and can deliver the value of an API across the Internet.","image":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/building-blocks\/bw-widget.png","width":"0","tags":"","category":"Widgets","categoryslug":"embeddable"}],"published":"11\/09\/2013"}