{"company":[{"id":"3","name":"Apigee","summary":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises li","details":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises like Comcast, GameSpy, TransUnion Interactive, Guardian Life and Constant Contact and thousands of developers use Apigee's technology.\nApigee provides resources to help you understand best practices, avoid common pitfalls, develop your strategy, and learn to drive your developer community. Apigee also provides articles, white papers, and other resources to help you deliver your API.","website":"http:\/\/developer.apigee.com\/","twitter":"https:\/\/twitter.com\/Apigee","github":"https:\/\/github.com\/apigee","blog":"http:\/\/blog.apigee.com\/","blogrss":"http:\/\/feeds.apigee.com\/ApigeeBlog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apigee-logo.gif","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3341_apigee_oauth.png","tags":"API Discovery,API Gateway,API Management,Apigee,Authentication,BaaS,Security,Utility"},{"id":"93","name":"APIhub","summary":"APIhub is the world's largest API repository, with new APIs added daily. APIhub serves developers and API publishers by providing a powerful publishing and community platform along with consoles and developer tools to insure rapid API adoption. APIhub is a property owned by integration platform provider MuleSoft, who also recently purchased the API directory ProgrammableWeb. APIhub provides API pr","details":"APIhub is the world's largest API repository, with new APIs added daily. APIhub serves developers and API publishers by providing a powerful publishing and community platform along with consoles and developer tools to insure rapid API adoption. APIhub is a property owned by integration platform provider MuleSoft, who also recently purchased the API directory ProgrammableWeb. APIhub provides API providers with a suite of API management tools, while also being a public API directory, and providing news and trends from the API space.","website":"http:\/\/www.apihub.com\/","twitter":"https:\/\/twitter.com\/apihub","github":"https:\/\/github.com\/apihub","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/APIhub-by-mulesoft.png","screenshot":null,"tags":"API Directory,API Discovery"},{"id":"9","name":"Mashape","summary":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, le","details":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, letting developers to easily discover and begin hacking with your API, in a social API community environment.","website":"http:\/\/www.mashape.com\/","twitter":"https:\/\/twitter.com\/mashape","github":"https:\/\/github.com\/Mashape","blog":"http:\/\/blog.mashape.com\/","blogrss":"http:\/\/feeds.feedburner.com\/MashapesVoice","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashape-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashape-Screenshot.png","tags":"API Directory,API Discovery,API Integration,API Management,API Operations"},{"id":"1","name":"Mashery","summary":"Mashery&rsquo;s API management tools and strategic services help companies connect with customers and partners in a changing digital world by extending reach across devices, markets and the Web. Mashery leads the industry with a holistic approach for API initiatives &ndash; from setting platform strategy and measuring business objectives to the heavy lifting of providing and managing infrastructur","details":"Mashery&rsquo;s API management tools and strategic services help companies connect with customers and partners in a changing digital world by extending reach across devices, markets and the Web. Mashery leads the industry with a holistic approach for API initiatives &ndash; from setting platform strategy and measuring business objectives to the heavy lifting of providing and managing infrastructure to facilitating relationships with our 150,000 strong network of Web and mobile application developers. Having worked with over 100 leading brands to power more than 40,000 apps, Mashery&rsquo;s knowledge, experience and proven strategies enable companies to focus on their core business while driving sales, building new revenue channels and realizing faster time-to-market for innovative applications.\nMashery was founded in 2006 and has built an impressive list of over 150 clients that include Best Buy, Netflix, ESPN, Rdio, D&amp;B, Expedia, Klout, USA TODAY and The New York Times.","website":"http:\/\/www.mashery.com","twitter":"https:\/\/twitter.com\/Mashery","github":"https:\/\/github.com\/mashery","blog":"http:\/\/blog.mashery.com\/","blogrss":"http:\/\/blog.mashery.com\/rss.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashery-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashery-Screenshot.png","tags":"API Discovery,API Management,Delyn Simons,Mashery,Oren Michels"},{"id":"96","name":"ProgrammableWeb","summary":"ProgrammableWeb is where you stay in tune with what's new and interesting with mashups, Web 2.0 APIs, and the new Web as Platform. The core of the site is the news blog and the 4 dashboards: Home, Mashups, APIs, and Members. New updates every day, 365 days a year.\nProgrammableWeb was the original public, web API directory, providing a growing directory of APIs that every developer has used to disc","details":"ProgrammableWeb is where you stay in tune with what's new and interesting with mashups, Web 2.0 APIs, and the new Web as Platform. The core of the site is the news blog and the 4 dashboards: Home, Mashups, APIs, and Members. New updates every day, 365 days a year.\nProgrammableWeb was the original public, web API directory, providing a growing directory of APIs that every developer has used to discover the APIs they are looking for. \nProgrammableWeb was started in 2005 by John Musser, and sold to Alcatel-Lucent in 2010, then again in 2013 to Mulesoft. ","website":"http:\/\/api.programmableweb.com","twitter":"https:\/\/twitter.com\/programmableweb","github":"https:\/\/github.com\/programmableweb","blog":"http:\/\/blog.programmableweb.com\/","blogrss":"http:\/\/feeds2.feedburner.com\/ProgrammableWeb","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/programmable-web-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/1420_programmableweb.png","tags":"API Directory,API Discovery"},{"id":"1687","name":"TheRightAPI","summary":"TheRightAPI allows you to explore APIs, then evaluate information on each API such as cost, terms of use and documentation--then share your feedback with the community by rating and commenting on APIs in their registry.\nDevelopers can try out API usage scenario through test harness or leverage one of the scenarios shared by others in TheRightAPI community. Developers can then automate your tests s","details":"TheRightAPI allows you to explore APIs, then evaluate information on each API such as cost, terms of use and documentation--then share your feedback with the community by rating and commenting on APIs in their registry.\nDevelopers can try out API usage scenario through test harness or leverage one of the scenarios shared by others in TheRightAPI community. Developers can then automate your tests scenarios to run as often as once a minute or as little as once a day based on your subscription, allowing view of activity through charts, then set alerts of any critical errors.","website":"http:\/\/www.therightapi.com\/","twitter":"https:\/\/twitter.com\/rightapi","github":"https:\/\/github.com\/theRightAPI","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/therightapi-logo-2.png","screenshot":null,"tags":"API Discovery,API Integration,API Monitoring,API Operations,API Testing,API-Discovery"}],"published":"11\/09\/2013"}