[{"unique":"c2a4ed0a449b81adc51985440ba3fa89","agency_id":"gsa","identifier":"GSA-32421","title":"Data.gov Dataset Monthly Download Trends","slug":"datagov-dataset-monthly-download-trends","description":"This dataset provies the trend of downloads in Data.gov. These numbers represent the number of times a user has clicked on the XML or CSV (for example) links in the Raw Data Catalogs to download datasets and user downloads of tools in the Tool Catalog available in these categories.","download_url":"","accessURL":"https:\/\/explore.data.gov\/dataset\/Data-gov-Dataset-Monthly-Download-Trends\/vx25-4bgc","distribution":[],"adoptions":[]},{"unique":"8e962f098fb5f71d2cb8fd0d1ffcd8cd","agency_id":"gsa","identifier":"GSA-32491","title":"Data.gov Top 10 Visiting Countries","slug":"datagov-top-10-visiting-countries","description":"This dataset provides top 10 visiting countries by month in Data.gov","download_url":"","accessURL":"https:\/\/explore.data.gov\/dataset\/Data-gov-Top-10-Visiting-Countries\/czf7-qvqf","distribution":[],"adoptions":[]},{"unique":"afd2b8136529354201f84517194079d8","agency_id":"gsa","identifier":"GSA-4305","title":"Energy Usage Analysis System","slug":"energy-usage-analysis-system","description":"The EUAS application is a web based system which serves Energy Center of Expertise, under the Office of Facilitates Management and Service Programs. EUAS is used for tracking energy details for various energy sources namely electricity, natural gas, oil, chilled water, steam and renewable energy.","download_url":"","accessURL":"http:\/\/www.gsa.gov\/dg\/EUAS.zip","distribution":[],"adoptions":[]},{"unique":"121f3b9ae04e64d440613c478ff8bc40","agency_id":"gsa","identifier":"GSA-6369","title":"Federal Acquisition Service Instructional Letter 2011","slug":"federal-acquisition-service-instructional-letter-2011","description":"The GSA Federal Acquisition Service Instructional Letters (ILs) - guidance issued to internal FAS acquisition personnel that generally requires action as a result of a regulatory or programmatic change, e.g. inserting a new clause into solicitations and contracts. nAll ILs are current only as of the date posted and are subject to amendment, update, and supersession without further notice being posted on this site. Changes and revisions to regulatory or statutory guidance subsequent to the effective date of this IL may affect its relevancy and accurateness. The IL is provided for informational purposes only.","download_url":"","accessURL":"https:\/\/explore.data.gov\/dataset\/2011-Instructional-Letters\/gxu5-zmjz","distribution":[],"adoptions":[]},{"unique":"58154759368911d8b66e11c0945320c4","agency_id":"gsa","identifier":"GSA-4671","title":"Fine Arts Database (FAD)","slug":"fine-arts-database-fad","description":"The Fine Arts Database records information on federally owned art in the control of the GSA; this includes the location, current condition and information on artists.","download_url":"","accessURL":"http:\/\/www.gsa.gov\/dg\/data_gov_feed_FACIT.csv.rar","distribution":[],"adoptions":[]},{"unique":"4f8fb860c8ea851b4bdf53e729f1c8db","agency_id":"gsa","identifier":"GSA-30251","title":"Jobs API","slug":"jobs-api","description":"This Jobs API returns job openings across the federal government and includes all current openings posted on USAJobs.gov that are open to the public and located in the United States. It also includes some state and local government jobs.","download_url":"","accessURL":"http:\/\/usasearch.howto.gov\/developer\/jobs.html","distribution":[],"adoptions":[]},{"unique":"2aebe3161264f2f26f850eb420986840","agency_id":"gsa","identifier":"GSA-4308","title":"Natural Gas Acquisition Program","slug":"natural-gas-acquisition-program","description":"The NGAP system is a web based application which serves NGAP GSA users for tracking information details for various natural gas supply chain elements like Agency, LDC, and Facility with their respective Point of Contacts information. In addition to this, it also maintains the Cost & Usage Data and Invoices for the Facilities under different account managers.","download_url":"","accessURL":"http:\/\/www.gsa.gov\/dg\/pbs\/DATA.gov_NGAP.xlsx","distribution":[],"adoptions":[]},{"unique":"a108388a2a0312aab9aca5fccfbf4c4a","agency_id":"gsa","identifier":"GSA-25251","title":"Real Estate Across the United States (REXUS) Inventory (Building)","slug":"real-estate-across-the-united-states-rexus-inventory-building","description":"Real Estate Across the United States (REXUS) is the primary tool used by PBS to track and manage the government's real property assets and to store inventory data, building data, customer data, and lease information. STAR manages aspects of real property space management, including identification of all building space and daily management of 22,000 assignments for all property to its client Federal agencies. This data set contains PBS building inventory that consists of both owned and leased buildings with active and excess status.","download_url":"","accessURL":"http:\/\/www.gsa.gov\/dg\/data_gov_bldg_star.csv","distribution":[],"adoptions":[]},{"unique":"178953ae7693644d17d27b6546c690e5","agency_id":"gsa","identifier":"GSA-30261","title":"Recalls API","slug":"recalls-api","description":"This Recalls API allows you to tap into a list of (1) drug and food safety recalls from the Food and Drug Administration, Food Safety and Inspection Service, and FoodSafety.gov; (2) car safety recalls from the National Highway Traffic Safety Administration; and (3) product safety recalls from the Consumer Product Safety Commission.","download_url":"","accessURL":"http:\/\/usasearch.howto.gov\/developer\/recalls.html","distribution":[],"adoptions":[]},{"unique":"954a48da6c6fab32aab390c3c2738290","agency_id":"gsa","identifier":"GSA-5008","title":"RWA Entry & Tracking Application (RETA)","slug":"rwa-entry--tracking-application-reta","description":"The Reimbursable Work Authorization (RWA) Entry & Tracking Application (RETA) is a web based system that serves the Public Buildings Service as a centralized repository for Reimbursable Work Authorization information. It is a national PBS RWA database warehouse with electronic interface capabilities into the NEAR RWA Database System.","download_url":"","accessURL":"http:\/\/www.gsa.gov\/dg\/RETADataGov.zip","distribution":[],"adoptions":[]},{"unique":"34ad26bdd548dd15bb7c70c7cad8e313","agency_id":"gsa","identifier":"GSA-2641","title":"Schedule Sales Query Report Generation System","slug":"schedule-sales-query-report-generation-system","description":"Schedule Sales Query presents sales volume figures as reported to GSA by contractors. The reports are generated as quarterly reports for the current year and the past five fiscal years. The sales data reported here are updated as contractors' reports are received, but the data may not be up to date as adjustments can be received at any time. The information on this site mirrors the data used by GSA for contract administration and fee management. It is not the official source of sales data. This data should be used for informational purposes only.","download_url":"","accessURL":"http:\/\/ssq.gsa.gov","distribution":[],"adoptions":[]},{"unique":"262aa71fe3caa2f9f00c190d48751e7f","agency_id":"gsa","identifier":"GSA-0001","title":"USA.gov Blog RSS feed","slug":"usagov-blog-rss-feed","description":"We help you find official U.S. government information and services on the Internet.","download_url":"","accessURL":"http:\/\/feeds.feedburner.com\/USAgov-blog?format=xml","distribution":[],"adoptions":[]},{"unique":"7f75c2de9605150be03c518669e95053","agency_id":"gsa","identifier":"GSA-132","title":"USAspending.gov Contracts and Purchases","slug":"usaspendinggov-contracts-and-purchases","description":"Provides U.S. Federal Spending by agency. The Contracts section allows searching for data relating to all Federal contracts. There are three main categories of searches: by contractor, by location, and by contracting agency. The Purchase section allows users to view purchase cards spending of various federal agencies for each fiscal year. The data available on this website are extracted from the report published once every quarter on the GSA SmartPay website. The GSA SmartPay receives this data directly from the banks that issued the purchase cards. This tool allows you to structure your search for data contained on USAspending.gov website.","download_url":"","accessURL":"http:\/\/www.usaspending.gov\/data?carryfilters=on","distribution":[],"adoptions":[]},{"unique":"289633276ab5b7f025b4784dabe66571","agency_id":"gsa","identifier":"GSA-133","title":"USAspending.gov Grants and Loans","slug":"usaspendinggov-grants-and-loans","description":"Provides U.S. Federal Spending by agency. The Grants section allows visitors to search for information about federal assistance; including grants, insurance, direct payments, and other. Information about federal loan spending can be found on the Loans section, which allows visitors to search for information about different federal loan categories, including Direct Loans and Guaranteed Loans. This tool allows you to structure your search for data contained on USAspending.gov website.","download_url":"","accessURL":"http:\/\/www.usaspending.gov\/data?carryfilters=on","distribution":[],"adoptions":[]}]