[{"unique":"05ed3868d73381892b888ba9f0be0181","agency_id":"nist","identifier":"EBC9DB05EDEC5B0EE043065706812DF83","title":"Atomic Spectra Database","description":"This database provides access and search capability for NIST critically evaluated data on atomic energy levels, wavelengths, and transition probabilities that are reasonably up-to-date. The Atomic Spectroscopy Data Center  has carried out these critical compilations. The Data Center is located in the Physical Measurement Laboratory at theNational Institute of Standards and Technology (NIST).","download_url":"","accessURL":"","distribution":[{"format":"","accessURL":"http:\/\/www.nist.gov\/pml\/data\/asd.cfm"}]},{"unique":"67c7619bbe329edd215261b2359fc2e9","agency_id":"nist","identifier":"DOC-1189","title":"AvailTech","description":"This is an easy-to-use tool that helps you find NIST innovations by browsing by application, technical field or by searching keywords or researcher name.","download_url":"","accessURL":"","distribution":[{"format":"rss","accessURL":"http:\/\/tsapps.nist.gov\/techtransfer\/"}]},{"unique":"a1644a87dd84e90f2e12206b14174824","agency_id":"nist","identifier":"EBC9DB05EDEF5B0EE043065706812DF86","title":"Chem-Blast Gateway for PDB","description":"Chem-BLAST (Chemical Block Layered Alignment of Substructure) is a technique (Prasanna M.D, Vondrasek J, Wlodawer A, Rodriguez H, Bhat T.N. Chemical compound navigator: a web-based Chem-BLAST, chemical taxonomy-based search engine for browsing compounds. Proteins 63(4), 907-917(2006)) was originally developed in the context of the HIV Structural database ( http:\/\/xpdb.nist.gov\/hivsdb\/hivsdb.html and http:\/\/bioinfo.nist.gov\/SemanticWeb_pr3d\/chemblast.do ). Recently we significantly improved this method to extend this it to the ligands found in the PDB. The methods establishes a tree-like relationship between the structural scaffolds involving rings found in the three-letter-codes that denote the lignads of the structures found in the Protein Data Bank by  first establishes a RDF (Resource Description Framework) like relations between the structural scaffolds of the ligands and then organizes them in a database table in the form of XML. Adobe Flex based Web interface is then used to present this information over the Web. Plans are under way to extend this work to non-ring type scaffolds as well. )(from http:\/\/xpdb.nist.gov\/pdb_chem_blast\/help.html)","download_url":"","accessURL":"","distribution":[{"format":"website","accessURL":"http:\/\/xpdb.nist.gov\/chemblast\/pdb.html"}]},{"unique":"281ed1a5634f4a56b3f5aa79c0919a3c","agency_id":"nist","identifier":"EBC9DB05EDEA5B0EE043065706812DF81","title":"Data Catalog","description":"Version 1.0","download_url":"","accessURL":"","distribution":[{"format":"application\/json","accessURL":"http:\/\/www.nist.gov\/data.json"}]},{"unique":"c24f79ef796bef1ba91a74f1669f3d5b","agency_id":"nist","identifier":"EBC9DB05EDEB5B0EE043065706812DF82","title":"Fundamental Physical Constants ","description":"Internationally recommended values of the fundamental physical constants from the Committee on Data for Science and Technology of the International Council for Science.","download_url":"","accessURL":"","distribution":[{"format":"TXT","accessURL":"http:\/\/physics.nist.gov\/cuu\/Constants\/Table\/allascii.txt"}]},{"unique":"386b86be83d54bfd8fe5ec0e4ac85369","agency_id":"nist","identifier":"EBC9DB05EDF05B0EE043065706812DF87","title":"Interatomic Potentials Repository","description":"This repository provides a source for interatomic potentials (force fields) and evaluation tools to help researchers obtain interatomic models and judge their quality and applicability. Users are encouraged to download interatomic potentials, and developers are welcome to contribute potentials for inclusion. The potentials provided have been submitted or vetted by their developers and appropriate references are provided. While many potentials are metallic and of the embedded-atom (EAM) form, other classes of potentials (e.g., MEAM, Reax, etc.) and materials are welcome. These could include semiconductors, polymers, and\/or materials like carbides.  If you do not find the element or alloy potential you are seeking, send an email to Chandler.Becker@nist.gov, and we may be able to help. This site reflects what has been submitted, so it is not a complete survey of interatomic potentials for any or all systems. Here is a list of recent requests for potentials. http:\/\/www.ctcms.nist.gov\/potentials\/requests.html If you find this website useful, including using potentials you downloaded, please cite this project in addition to the proper interatomic potential reference: C.A. Becker,'Atomistic simulations for engineering: Potentials and challenges,' in Tools, Models, Databases and Simulation Tools Developed and Needed to Realize the Vision of ICME, ASM (2011). http:\/\/www.ctcms.nist.gov\/potentials Please note that, due to the wide range of interatomic potential functions and formats, It is the user's responsibility to check that the interatomic potentials produce expected results.","download_url":"","accessURL":"","distribution":[{"format":"","accessURL":"http:\/\/www.ctcms.nist.gov\/potentials"}]},{"unique":"c4063c7699447d85dae7438a2f66b4df","agency_id":"nist","identifier":"EBC9DB05EDF45B0EE043065706812DF811","title":"NIST \/ TRC Web Thermo Tables, Professional Version SRD 203","description":"This web application provides access to a collection of critically evaluated thermodynamic property data for pure compounds with a primary focus on organics. These data were generated through dynamic data analysis, as implemented in the NIST ThermoData Engine software package. Some critically evaluated data from the historical TRC Thermodynamic Tables archive are included, also. As of May 2012, the Professional Edition contains information on 28,432 compounds and total of 531,486 evaluated data points.","download_url":"","accessURL":"","distribution":[{"format":"","accessURL":"http:\/\/wtt-pro.nist.gov\/wtt-pro\/"}]},{"unique":"94c87fa509818ac16361139b6a815787","agency_id":"nist","identifier":"EBC9DB05EDED5B0EE043065706812DF84","title":"NIST Chemical Kinetics Database","description":"The NIST Chemical Kinetics Database includes essentially all reported kinetics results for thermal gas-phase chemical reactions. The database is designed to be searched for kinetics data based on the specific reactants involved, for reactions resulting in specified products, for all the reactions of a particular species, or for various combinations of these. In addition, the bibliography can be searched by author name or combination of names. The database contains in excess of 38,000 separate reaction records for over 11,700 distinct reactant pairs. These data have been abstracted from over 12,000 papers with literature coverage through early 2000. Rate constant records for a specified reaction are found by searching the Reaction Database. All rate constant records for that reaction are returned, with a link to 'Details' on that record. Each rate constant record contains the following information (as available): Reactants and, if defined, reaction products; Rate parameters: A, n, Ea\/R, where k = A* (T\/298)**n exp[-(Ea\/R)\/T], where T is the temperature in Kelvins; Uncertainty in A, n, and Ea\/R, if reported; Temperature range of experiment or temperature range of validity of a review or theoretical paper; Pressure range and bulk gas of the experiment; Data type of the record (i.e., experimental, relative rate measurement, theoretical calculation, modeling result, etc.). If the result is a relative rate measurement, then the reaction to which the rate is relative is also given; Experimental procedure, including separate fields for the description of the apparatus, the time resolution of the experiment, and the excitation technique. A majority of contemporary chemical kinetics methods are represented. The Kinetics Database is being expanded to include other resources for the convenience of the users. Presently this includes direct links to the corresponding NIST WebBook page for all substances for which such a link is possible. This is indicated by underling and highlighting the species. The WebBook provides thermodynamic, spectral, and other data on the species. Note that the link to the WebBook is opened as a new frame in your browser.","download_url":"","accessURL":"","distribution":[{"format":"","accessURL":"http:\/\/kinetics.nist.gov\/kinetics\/"}]},{"unique":"c571d06c236bac3e428da8835588bd5b","agency_id":"nist","identifier":"EBC9DB05EDEE5B0EE043065706812DF85","title":"NIST Chemistry WebBook","description":"The NIST Chemistry WebBook provides users with easy access to chemical and physical property data for chemical species through the internet. The data provided in the site are from collections maintained by the NIST Standard Reference Data Program and outside contributors. Data in the WebBook system are organized by chemical species. The WebBook system allows users to search for chemical species by various means. Once the desired species has been identified, the system will display data for the species.","download_url":"","accessURL":"","distribution":[{"format":"","accessURL":"http:\/\/webbook.nist.gov\/chemistry"}]},{"unique":"00a72e9d7d2c44a2ff184f7314c26f13","agency_id":"nist","identifier":"DOC-1190","title":"SBIR Website - Data","description":"The SBIR program at NIST solicits scientific and engineering related R&D proposals for contracts from small businesses that respond to specific technical needs that are described in the annual Solicitation.","download_url":"","accessURL":"","distribution":[{"format":"rss","accessURL":"http:\/\/tsapps.nist.gov\/ts_sbir\/sbirrss\/index.cfm?action=contractrssfeed"}]},{"unique":"d624be97204e1be01d48c2d2850a11a7","agency_id":"nist","identifier":"DOC-1191","title":"SBIR Website - Solicitation","description":"This is the annual Solicitation for the SBIR program at NIST.  It solicits scientific and engineering related R&D proposals for contracts from small businesses that respond to specific technical needs described in this annual Solicitation.","download_url":"","accessURL":"","distribution":[{"format":"rss","accessURL":"http:\/\/tsapps.nist.gov\/ts_sbir\/sbirrss\/"}]}]